app/controllers/posts_controller.rb

  def show
    @id = params[:id]
    @post = Post.find_by(id:@id)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]

  def create
    @post = Post.new(content: params[:content], user_id: session[:user_id])
    if @post.save
---
INSERT INTO "posts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "ガストなう"], ["created_at", "2020-02-02 10:33:54.112094"], ["updated_at", "2020-02-02 10:33:54.112094"], ["user_id", 10]]

  def edit
    @id = params[:id]
    @post = Post.find_by(id:@id)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def update
    @id = params[:id]
    @post = Post.find_by(id:@id)
    @post.content = params[:content]
    if @post.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "あああ"], ["updated_at", "2020-01-26 13:06:47.914964"], ["id", 13]]

  def delete
    @id = params[:id]
    @post = Post.find_by(id:@id)
    @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 19]]