app/controllers/users_controller.rb

  def login_form
    @user = User.find_by(email: params[:email],
                         password: params[:password])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? AND "users"."password" = ? LIMIT ?  [["email", "nicol32250@gmail.com"], ["password", "nicol2525"], ["LIMIT", 1]]

  def create
    @user = User.new(name: params[:name],
                     email: params[:email],
                     password: params[:password],
                     image: "default_user.jpg")

    if @user.save
---
INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at", "image") VALUES (?, ?, ?, ?, ?, ?)  [["name", "ガストマン"], ["email", "gasuto"], ["password", "gasuto"], ["created_at", "2020-02-02 10:52:18.462655"], ["updated_at", "2020-02-02 10:52:18.462655"], ["image", "default_user.jpg"]]

  def mypage
    @user = User.find_by(id: session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]